PerrosGatos/exportacion-perros-gatos/documento.tex
% Created 2025-11-20 Thu 10:42
% Intended LaTeX compiler: pdflatex
\documentclass[11pt, a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{lmodern}
\usepackage{geometry}
\geometry{margin=1in}
\usepackage{sectsty}
\allsectionsfont{\bfseries\Large}  % títulos en negrita y más grandes
\setcounter{secnumdepth}{0}        % desactiva la numeración de secciones
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\section{Implementacion de Clasificador de Perros y Gatos Por internet}
\label{sec:orge396f0a}

\subsection{Clasificador}
\label{sec:org61ff2df}

Se entreno una CNN sobre un dataset que contiene imagenes de perros y gatos. Las imagenes fueron preprocesadas
en blanco y negro y recortada a tamano 100 x 100.
\subsection{Implementacion en Internet.}
\label{sec:orgad5d021}

\begin{enumerate}
\item El modelo esta en un formato .h5, hay que pasarlo a un formato para produccion, en este caso con tensorflowjs
podemos pasarlo el .h5 a un archivo .json que es la arquitectura del modelo, junto con los binarios que ya
tiene los pesos cargados del entrenamiento.

\item Usando el .json y los binarios se conecta con tensorflowjs al html por medio de javascript.

\item Ponemos una camara en el html para que nos puedan pasar las imagenes. Lo que se hace es que cada cierto tiempo
captura la imagen de la camara, hace el preprocesamiento de pasarla a 100 x 100, la convierte a blanco y negro,
hace la prediccion y base a esta ponemos debajo de la cámara si es un perro o un gato.

\item Para que funcione en el celular se hace lo siguiente:
\begin{itemize}
\item Se crea un servidor local con python.
\item Con ngrok se hace un tunel a un servidor de ellos, con esto nos dan un link que podemos pasarlo a cualquier persona
y va a funcionar.
\end{itemize}
\end{enumerate}
\end{document}
